Repository: mohammadzyoud1/ROK-app
Catalog: lib/l10n/app_*.arb
Languages: ar

# henry_tree_rally_2
source: This tree increases skill damage and all damage through (Whistling Arrows) from the skill path,will be given up on the talents which decrease the skill damage taken in order to increase all damage through (Entrenched) talent and also reduce counterattack damage received through (Buckler Shield).
ar: هذه الشجرة ترفع أضرار المهارة والأضرار الكلية من خلال (اسهم الصافرة) من مسار المهارة ، سوف تتخلى عن مواهب تقليل أضرار المهارة المتلقاة عليه في سبيل رفعك للأضرار الكلية من خلال موهبة (محصن) وأيضا تقليل الأضرار المضادة المتلقاة من خلال (ترس الدرع)

# dido_tree_garrison_1
source: This is a tree that increases skill damage from the archer path and also from the garrison path, and reduces all damage, specifically skill damage from the garrison path and also the support path.
ar: هذه شجرة فيها رفع لأضرار المهارة من مسار الرماة والكلية أيضا من مسار الحامية ، وتقلل الأضرار الكلية وتحديدا أضرار المهارة من مسار الحامية وأيضا مسار الدعم

# dido_tree_garrison_2
source: A tree used agaisnt commander has no skill damage so all talents that reduce skill damage are removed and talents that reduce total damage received are kept in garrison path while raising all troops' stats attack, defense and health, and also focusing on raising the skill damage and attack side of the archers track, and all damage in the garrison path.
ar: انتزعنا جميع المواهب التي تقلل أضرار المهارة وأبقينا تلك التي تقلل أضرار كلية متلقاة عليها من مسار الحامية مع رفع احصائيات جميع القوات من هجوم ودفاع وصحة ، و ركزنا على رفع جانب أضرار المهارة والهجوم من مسار الرماة ، والأضرار الكلية من مسار الحامية

# boudica_tree_field_1
source: This is a tree that aims to activate active skill faster, especially if you do not have a horn of fury, this is the one for you, and if you have a horn of fury , it is also suitable for you. It focuses on raising all skill damage in general.
ar: هذه شجرة هدفها تفعيل المهارة الأولى بشكل أسرع بالأخص اذا كنت لا تمتلك بوق ، فهذه هي المناسبة لك ، ولو كنت تمتلك بوق أيضا هي مناسبة لك ان أحببت اللعب بهذا التصميم . وتركز على رفع جميع أضرار المهارة عموما

# boudica_tree_field_2
source: This tree focuses on increasing skill damage, as well as all damage through the Archer Path talent (whistling Arrows). This is more specifically suited for those with horn of fury or drum.
ar: هذه الشجرة تركز على تقوية أضرار المهارة ، وأيضا تقوية الأضرار الكلية من خلال موهبة (اسهم الصافرة) الخاص بمسار الرماة . وهذه مناسبة تحديدا أكثر لمن لديهم بوق أو طبلة عموما

# hera_tree_garrison_1
source: For structure
ar: للمعاقل

# hera_tree_garrison_2
source: Against swarm
ar: ضد السوارم

# hera_tree_garrison_3
source: For the city
ar: للمدينة

source: important
ar: مهم

# alert_text
source: All information about the commanders,pairs,talents and equipmets is no more than opinions. Ragnar Prime will be added later after reports from wars.
ar: كل المعلومات عن القادة و الشجرات و المعدات مجرد اراء. سيتم اضافو راجنار برايم لاحقا بعد التجارب.

# recommnded_equipments_and_talents
source: Recommended equipments and talents
ar: المعدات والمواهب الموصى بها
