Repository: mohammadzyoud1/ROK-app
Catalog: lib/l10n/app_*.arb
Languages: ar

# language
source: English
ar: العربية

source: Commanders
ar: القادة

source: Rss and Data
ar: الموارد و التسريعات

source: From
ar: من

source: To
ar: الى

# rss
source: RSS and data
ar: الموارد

source: Healing
ar: العلاج

source: training
ar: التدريب

source: equipments
ar: المعدات

source: total
ar: المجموع

source: minutes
ar: دقيقة

source: total amount of speedup needed
ar: التسريعات المطلوبة

source: RSS needed
ar: الموارد المطلوبة

source: Food
ar: طعام

source: Wood
ar: خشب

source: Stone
ar: حجر

source: Gold
ar: ذهب

source: Training buff
ar: بف التدريب

source: Troops amount
ar: مقدار القوات

source: Enter only numbers
ar: ادخل قيم رقمية

source: Healing Buff
ar: بف العلاج

source: alliance help count
ar: عدد مساعدات التحالف

source: Rss reduction
ar: تخفيض استهلاك الموارد

source: Type
ar: النوع

source: Tier
ar: المستوى

source: Upgrade
ar: تطوير

# power
source: Power Points
ar: نقاط القوة

source: MGE points
ar: نقاط الحاكم الاعظم

# hint_text_non_numerical
source: Any non numerical data will cause the field value = 0
ar: اي قيمة غير رقمية ستجعل قية المدخل 0

source: Pairs
ar: الثنائيات

source: Field trees
ar: شجرات الميدان

source: Rally trees
ar: شجرات الحشود

source: Garrison trees
ar: شجرات الحامية

source: Cavalry
ar: فرسان

source: Infantry
ar: مشاة

source: Archer
ar: رماة

source: Siege
ar: المقاليع

source: Leadership
ar: القيادة

source: Troop
ar: قوات

source: None
ar: لا شيء

source: Filter
ar: فلتر

source: Compare
ar: مقارنة

source: refine
ar: صقل

source: Infantry attack
ar: هجوم المشاة

source: Infantry defense
ar: دفاع المشاة

source: Infantry health
ar: صحة المشاة

source: Cavalry attack
ar: هجوم الفرسان

source: Cavalry defense
ar: دفاع الفرسان

source: Cavalry health
ar: صحة الفرسان

source: Archer attack
ar: هجوم الرماة

source: Archer defense
ar: دفاع الرماة

source: Archer health
ar: صحة الرماة

source: Siege attack
ar: هجوم المقاليع

source: Siege defense
ar: دفاع المقاليع

source: Siege health
ar: صحة المقاليع

source: Troop attack
ar: هجوم القوات

source: Troop defense
ar: دفاع القوات

source: Troop health
ar: صحوة القوات

source: Infantry base attack
ar: هجوم المشاة الأساسي

source: Infantry base defense
ar: دفاع المشاة الأساسي

source: Infantry base health
ar: صحة المشاة الأساسي

source: Cavalry base attack
ar: هجوم الفرسان الأساسي

source: Cavalry base defense
ar: دفاع الفرسان الأساسي

source: Cavalry base health
ar: صحة الفرسان الأساسي

source: Archer base attack
ar: هجوم الرماة الأساسي

source: Archer base defense
ar: دفاع الرماة الأساسي

source: Archer base health
ar: صحة الرماة الأساسي

source: Siege base attack
ar: هجوم المقاليع الأساسي

source: Siege base defense
ar: دفاع المقاليع الأساسي

source: Siege base health
ar: صحة المقاليع الأساسي

source: Troop base attack
ar: هجوم القوات الأساسي

source: Troop base defense
ar: دفاع القوات الأساسي

source: Troop base health
ar: صحة القوات الأساسي

source: Field marchs
ar: مسيرات الميدان

source: Infantry marchs
ar: مسيرات المشاة

source: Cavalry marchs
ar: مسيرات الفرسان

source: Archer marchs
ar: مسيرات الرماة

source: Garrison pairs
ar: ثنائيات حامية

source: Rally pairs
ar: ثنائيات حشود

source: Alexnder Nevsky
ar: نفسكي

source: Ashurbanipal
ar: اشور

source: Belisarius Prime
ar: بيليساريوس برايم

source: Boudica Prime
ar: بوديكا برايم

# justinian
source: Justinian I
ar: جستينيان

source: Gorgo
ar: جورجو

source: Guan yu
ar: جوان يو

source: Heraclius
ar: هرقل

source: Huo qubing
ar: هواتشوبينغ

source: Herman Prime
ar: هرمان برايم

source: Joan of arc Prime
ar: جان أرك برايم

source: Zhuge Liang
ar: ليانغ

source: Liu che
ar: ليوتشي

source: Sargon the great
ar: سرجون

source: Scipio Aemilianus
ar: سكيبيو امليانوس

source: scipio africanus Prime
ar: سكيبيو بريام

source: Tariq ibn Ziad
ar: طارق ابن زياد

source: Henry V
ar: هنري الخامس

source: Wiliam walace
ar: ويليام والاس

source: Xiang Yu
ar: شيانق يو

source: Jan zizka
ar: يان زيزكا

source: Eleanor
ar: ايلانور

source: Dido
ar: عليسة

# shajar
source: Shajar Al-durr
ar: شجر الدر

# yeong
source: Choe Yeong
ar: يونغ

source: Field secondary commanders
ar: ثانويين للميدان

source: Rally secondary commanders
ar: ثانويين للحشود

source: Garrison secondary commanders
ar: ثانويين للحامية

source: March details
ar: تفاصيل المسيرة

source: this commander is not recommended for field
ar: لا ينصح به للميدان

source: this commander is not recommended for rally
ar: لا يصنح به للحشود

source: this commander is not recommended for garrison
ar: لا ينصح به للحاميات

# generalspeachabouthuo
source: ✅ He features (Autumn Winds) which reactivates the third skill when he defeats a march or a march commits suicide on him, and also reactivates a talent from the cavalry path (Rallying cry) which raises the total damage for 10 seconds from the time he enters any battle ✅ Reduces target's march speed ✅ Increases Attack + Defense + Speed ​​of cavalry ✅ Increases the skill damage ✅ Activates healing whenever he defeats an enemy troops or exits a combat.✅ Proper formation: Wedge
ar: يتميز بـ ( رياح الخريف ) التي تعيد تفعيل المهارة الثالثة عندما ينتصر على مسيرة أو تنتحر مسيرة عليه ، وتعيد أيضا تفعيل موهبة من مسار الفرسان ( نداء الحشد ) التي ترفع الأضرار الكلية لمدة 10 ثوان من دخوله لأي معركة ✅ يقلل سرعة مسيرة الهدف ✅ يرفع هجوم + دفاع + سرعة الفرسان ✅ يرفع أضرار المهارة ✅ يفعل مهارة علاجية عند الانتهاء من معركة ✅ التشكيل المناسب : الوتد

# generalspeachaboutnevsky
source: ✅ He is the most balanced cavalry commander in terms of damage and endurance ✅ Single target ✅ Reduces the target's defense ✅ Increases all cavalry buff attack + defesne + health + march speed and foucsign on the health more ✅ Increases the skill damage ✅ If the target is surrounded, he increases the damage and takes less damage ✅ Increases the normal damage ✅ Proper formation : wedge and arch
ar: يمتاز بأنه أكثر قائد فرسان توازنا كأضرار وكصمود ✅ يضرب هدف فردي ✅ يقلل دفاع الهدف ✅ يرفع جميع احصائيات الفرسان دفاع + هجوم + سرعة ، ويركز على رفع الصحة بنسب أكبر ✅ يرفع أضرار المهارة ✅ يرفع أضراره الكلية اذا كان الهدف محاصر ، ويتلقى أضرار أقل ✅ يرفع الأضرار العادية ✅ التشكيل المناسب : الوتد+ القوس

# generalspeachaboutjoan
source: ✅ Deals direct damage up to 3 enemy troops in fan shape ✅ Gives up to 3 nearby allied or firendly troops(inicluding her troops) more damage and rage points ✅ Increases the cavalry attack, health and march speed ✅ increases the normal damage and the counterattack damage ✅ Activates her active skill twice (cooldown 10 seconds) ✅ Increases the damage dealt to troops with more than 30% units remaining ✅ Proper formation : wedge and arch
ar: تتميز بأنها تمنح 3 من حولها نقاط غضب + ترفع أضرارهم الكلية ✅ تضرب 3 أهداف أمامية ✅ ترفع هجوم + صحة + سرعة الفرسان ✅ ترفع الضرر العادي والمضاد ✅ تفعل مهارتها الأولى مرتين متتالية ، فترة ركود التفعيل 10 ثوان ✅ تزيد أضرار قواتها على أي هدف يمتلك أكثر من 30% من القوات ✅ التشكيل المناسب : الوتد + القوس

# generalspeachaboutelanor
source: ✅ Increaes the damage of up to 5 nearby allied or firendly troops (including her troops ) when serving as a garrison commander ✅ receive less skill damage ,counterattack damage and damage ✅ Increase cavalry attack and defense ✅ A probability to activate her active skill again when serving as a garrison commander (cooldown 10 seconds )✅ incresaes damage dealt ✅ Proper formation : wedge and arch
ar: تتميز برفع الأضرار الكلية لـ 5 من القوات حولها اذا كانت حامية ✅ تقلل أضرار المهارة ، الأضرار المضادة ، الأضرار الكلية المتلقاة عليها ✅ ترفع هجوم + دفاع الفرسان ✅ تمتلك مهارة فيها احتمالية تفعل مهارتها الأولى مرتين خلف بعض اذا كانت حامية ✅ ترفع الأضرار الكلية ✅ التشكيل المناسب : الوتد + القوس

# generalspeachaboutjustinian
source: ✅ When serving as a rally leader he creates illusion that there are three troops surrounding the target ✅ When servign as a rally commander, reduces the target's defenes ✅ Increases cavalry attack, defense, health and march speed ✅ receives less normal damage ✅ Increases his active skill damage according to the number of the troops surrounding the target ✅ Proper formation : wedge and arch
ar: يتميز بإيهام الهدف بأن هناك ثلاث قوات تضرب الهدف ( فائدة هذه المهارة أنها ستفعل بعض مهارات القادة التي هي مربوطة بشرط الحصار بينما جاستنيان ومن معه يضربون هدف واحد ) هذه لا تعمل الا اذا كان حاشد فقط ✅ يقلل دفاع الهدف ( اذا كان جاستنيان حاشد ) ✅ يرفع هجوم + دفاع + صحة + سرعة الفرسان ✅ يقلل الأضرار العادية المتلقاة عليه ✅ تزيد أضرار مهارته بناءا على عدد القوات التي تضرب الهدف المحاصر ، وفقا للمعادلة التي في مهارته الخاصة التي هي تطوير لمهارته الرابعة ✅ التشكيل المناسب : الوتد

# generalspeachaboutxy
source: ✅ Activates his active skill quickly ✅ Reduces the defense of 3 enemy troops ✅ Deals direct damage up to 3 enemy troops in fan shape ✅ Increases cavalry march speed and attack ✅ Increaes cavalry damage ✅ Increaese skill damage ❌ has no defensive attributes ✅ Proper formation : wedge
ar: يمتاز بسرعة تفعيل مهارته الأولى ✅ يقلل دفاع 3 أهداف أمامية ✅ يضرب 3 أهداف أمامية ✅ يركز على رفع سرعة + هجوم الفرسان ✅ يعزز من أضرار الفرسان كقوات ✅ يرفع أضرار المهارة ❌ لا يمتلك مهارات دفاعية ✅ التشكيل المناسب :الوتد

# generalspeachaboutzizka
source: ✅ Has high active skill damage factor as a garrison commander ✅ Receives less normal damage ✅ Increases cavalry attack, health and defense ✅ Removes the target's buffs ✅ Increase the normal damage ✅ Proper formation : wedge and arch
ar: يتميز بأضرار مهارة عالية كقائد حامية ✅ يقلل الأضرار العادية المتلقاة عليه ✅ يرفع هجوم + صحة + دفاع الفرسان ✅ يزيل التأثيرات العادية الايجابية لدى الهدف ✅ يرفع الأضرار العادية ✅ تزيد أضرار قواتها على أي هدف يمتلك أكثر من 30% من القوات ✅ التشكيل المناسب : الوتد + القوس

# generalspeachaboutwallace
source: ✅ Smite damage commander ✅ Dispels all slow effects from up to 3 nearby allied and friendly troops (including the commander's troops) then Grants them mighty shield ✅ Increasing the normal damage so that increases the smite damage ✅ Increases infantry stats except the defens ✅ Increaes the smite damage ✅ Proper formation : arch
ar: يمتاز بازالة أي تأثيرات تقلل سرعة مسيرته وثلاثة مسيرات حوله ✅ يمنح نفسه درع هائل ولثلاثة من حوله كذلك ✅ يرفع الأضرار العادية مما يرفع أضرار الضربة القاضية أيضا ✅ يرفع احصائيات المشاة ما عدا الدفاع ✅ يرفع أضرار الضربة القاضية ✅ يمتاز بأضرار الضربة القاضية ✅ التشكيل المناسب : القوس

# generalspeachaboutaemilianus
source: ✅ Smite damage commander ✅ Increaes the target's damage taken ✅ When attacking stronghold or city there is a chance to decreaes the target's attack and defense and if serving as primary commander the target will be silenced ✅ Decrease the damage taken ✅ Chance to dispel all health and defense debuffs ✅ Increase infantry march speed while outside of the alliance territory ✅ When leading a rally, Increaes the infantry health ✅ Proper formation : arch
ar: يمتاز بدي بف زيادة أضرار كلية على الهدف ✅ يسبب صمت على الهدف اذا كان أساسي ، وأيضا يقلل هجوم ودفاع الهدف في حال السوارم على المباني أو مدن ✅ يقلل الأضرار العادية المتلقاة عليه ✅ يمتلك مناعة من تقليل الصحة والدفاع السلبية عليه ✅ يمتلك مهارة تسرع من عملية عاصفة الغضب ✅ يرفع سرعة المشاة كميدان خارج أرض التحالف ، وأيضا يرفع صحة المشاة اذا كان حاشد ✅ يمتاز بأضرار الضربة القاضية ✅ التشكيل المناسب : القوس

# generalspeachaboutliuche
source: ✅ Smite damage commander ✅ AoE damage up to 5 targets and reduces their march speed ✅ Reduces the target's damage ✅ Reduces the skill damage taken ✅ Increases infantry stats except the health ✅ Has combo attack ✅ Proper formation : arch
ar: يمتاز بضرر المجموعة ✅ يقلل سرعة مسيرة خمسة أهداف ✅ يقلل أضرار الهدف الكلية عندما يتعرض الهدف لضربة قاضية ✅ يقلل أضرار مهارة متلقاة عليه ✅ يرفع جميع احصائيات المشاة ما عدا الصحة ✅ يسبب أضرار ضربة قاضية ✅ التشكيل المناسب : القوس

# generalspeachaboutgorgo
source: ✅ Smite damage commander ✅ Solid commander ✅ High ability to endure the swarm ✅ High normal damage ✅ Grants shield ✅ reduces attack of up to 5 nearby enemy troops ✅ Proper formation : arch and sometimes square and testudo
ar: تمتاز بالصلابة ✅ قدرة تحمل للسوارم عالية ✅ معدل أضرار عادية عالي ✅ تسبب أضرار ضربة قاضية ✅ تمنح درع ✅ تقلل هجمات خمسة أهداف حولها ✅ التشكيل المناسب : القوس

# generalspeachabouttariq
source: ✅ Solid commander ✅ Increases infantry attack ✅ Increaes the damage ✅ Reduces target's rage ✅ Proper formation : wedge and sometimes arch
ar: يمتاز بالصلابة ✅ يركز على رفع هجمات المشاة ✅ يرفع الأضرار الكلية ✅ يقلل عاصفة غضب الهدف ✅ يسبب أضرار مهارة ✅ التشكيل المناسب : الوتد

# generalspeachaboutscipio
source: ✅ Reduces health of 3 enemy troops ✅ Increaes all infantry stats except the defense ✅ Grants shiled to his troops and up to 3 nearby friendly troops ✅ If the target is silenced, grants rage quicker ✅ Proper formation : wedge and sometimes arch if his secondary commander is Liu che
ar: يمتاز بـ دي بف تقليل صحة ثلاثة اهداف ✅ فرصة 10% يرفع فيها الأضرار الكلية ✅ يرفع جميع احصائيات المشاة باستثناء الدفاع ✅ يقدم لنفسه درع ولمن حوله كذلك ✅ يكتسب غضب اسرع اذا كان الهدف قد تعرض للصمت ✅ يسبب أضرار مهارة ✅ التشكيل المناسب : الوتد, تشكيلات لاستخدامات أخرى : القوس

# generalspeachaboutsargon
source: ✅ Has debuff increasing the target's skill damage taken ✅ Chance to increase the damage ✅ Increaes all infantry stats ✅ Grants a shield ✅ Proper formation : wedge
ar: يمتاز بـ دي بف زيادة أضرار المهارة على هدف بشكل متكدس ✅ فرصة 10% يرفع فيها الأضرار الكلية ✅ يرفع جميع احصائيات المشاة ✅ يقدم لنفسه درع ✅ يسبب أضرار مهارة ✅ التشكيل المناسب : الوتد

# generalspeachaboutguan
source: ✅ Has debuff to silence up to 3 targets ✅ When receiving shield, increases the skill damage ✅ Healing after exiting combat ✅ Increases infantry attack ✅ Proper formation : wedge
ar: يمتاز بـ دي بف الصمت لتعطيل المهارة الأولى لـ ثلاثة اهداف ✅ عندما يكتسب درع من أي قائد ، ترتفع أضرار مهارته ✅ يمتلك عامل شفاء بعد الخروج من معركة ميدانية ✅ يركز على رفع هجمات المشاة ✅ يسبب أضرار مهارة ✅ التشكيل المناسب : الوتد

# generalspeachaboutbeli
source: ✅ Has debuff increasing the target's damage taken ✅ Decreases the target's rage and increases the target's rage requirement ✅ Increaes cavalry attack,defenes and speed march ✅ Decreases the skill damage taken ✅ His skill damage increases when the target his less than 80% unit remaining ✅ Proper formation : wedge
ar: ✅ يتميز بدي بف زيادة الأضرار على الهدف المستهدف من بيليساريوس ✅ يقلل عاصفة غضب الهدف ، ويزيد عليه متطلبات عاصفة الغضب بنفس الوقت ✅ يرفع هجوم + دفاع + سرعة الفرسان ✅ يقلل أضرار المهارة المتلقاة عليه ✅ تزيد أضرار مهارته اذا كان الهدف يمتلك اقل من 80% من القوات على الخريطة ✅ التشكيل المناسب : الوتد

# elanor_tree_garrison_1
source: Mainly is used to reduce all damages taken, and against archer rallies
ar: هذه الشجرة تركز على تقليل جميع الأضرار المتلقاة عليها ، وهي مخصصة فقط ضد حشود الرماة

# elanor_tree_garrison_2
source: Mainly is used to reduce all damages taken, and against infantry and cavalry rallies.
ar: هذه الشجرة تركز على تقليل جميع الأضرار المتلقاة عليها ، وهي مخصصة فقط ضد حشود الفرسان والمشاة

# elanor_tree_garrison_3
source: Mainly is used to reduce all damages taken except skill damage, and against smite damage rallies.
ar: هذه الشجرة تركز على تقليل جميع الأضرار المتلقاة عليها ( باستثناء أضرار المهارة ) ، وهي مخصصة فقط ضد اي قادة يسببون أضرار ضربة قاضية

# justinian_tree_field_1
source: This tree to reduce all damage taken and have (Disarm) talent which reduces the enemy's attack.
ar: هذه الشجرة تركز على تقليل جميع أضرار المهارة المتلقاة عليه ، بالاضافة لتفعيل موهبة تقليل هجوم الهدف (نزع السلاح) من مسار الفرسان

# justinian_tree_field_2
source: This tree to reduce all damage taken and have (Disarm) talent which reduces the enemy's attack, also to activate (Cage of thorns) talent which reduces march speed of 5 nearby enemies.
ar: هذه الشجرة تركز على تقليل جميع أضرار المهارة المتلقاة عليه ، بالاضافة لتفعيل موهبة تقليل هجوم الهدف (نزع السلاح) من مسار الفرسان ، وأيضا موهبة (قفص من الشوك) التي تقلل سرعة 5 مسيرة من قوات العدو

# justinian_tree_field_3
source: This tree to reduce all damage taken and activate (Buckler shield) talent which reduces the counterattack damage taken.
ar: هذه الشجرة تركز على تقليل جميع أضرار المهارة المتلقاة عليه ، بالاضافة موهبة (ترس من الدرع) لتقليل الأضرار المضادة المتلقاة عليه من مسار الاحتلال

# justinian_tree_rally_1
source: This tree to reduce all damage taken and have (Disarm) talent which reduces the enemy's attack.
ar: هذه الشجرة تركز على تقليل جميع أضرار المهارة المتلقاة عليه ، بالاضافة لتفعيل موهبة تقليل هجوم الهدف (نزع السلاح) من مسار الفرسان

# justinian_tree_rally_2
source: This tree to reduce all damage taken and activate (Buckler Shield) talent which reduces the counterattack damage taken
ar: هذه الشجرة تركز على تقليل جميع أضرار المهارة المتلقاة عليه ، بالاضافة موهبة (ترس من الدرع) لتقليل الأضرار المضادة المتلقاة عليه من مسار الاحتلال

# justinian_tree_rally_3
source: This tree to reduce all damage taken and activate (Entrenched) talent which increase the damage when attacking strongholds or cities.
ar: هذه الشجرة تركز على تقليل جميع أضرار المهارة المتلقاة عليه ، بالاضافة الى رفع الأضرار الكلية له كحاشد من موهبة (محصن)

# huo_tree_field_1
source: This tree focuses on increasing all skill damage, in addition to activating the (feral Nature) talent, which contributes to activating the active skill faster.It is specifically recommended for those who do not have the horn accessory, and you can use it if you have a horn as well. That is fine. In the end, it is chance of gaining rage points issue.
ar: هذه الشجرة تركز على رفع جميع أضرار المهارة ، بالاضافة لتفعيل موهبة (الطبيعة الوحشية) التي تساهم في تفعيل ضربة المهارة الأولى بشكل أسرع وينصح بها تحديدا من لا يملكون اكسسوار البوق، وتستطيع استعماله لو لديك بوق كذلك لا بأس بذلك ، في النهاية أنت تلعب على فرص اكتساب نقاط غضب

# huo_tree_field_2
source: This tree activates all talents that increase skill damage, in addition to activating the target's attack reduction (disarm) talent, and it activates all speed talents.
ar: هذه الشجرة فيها تفعيل لجميع المواهب التي ترفع أضرار المهارة ، بالاضافة الى تفعيل تقليل هجوم الهدف (نزع السلاح) من مسار الفرسان ، وفيها تفعيل لجميع مواهب السرعة

# huo_tree_field_3
source: This tree activates all talents that increase skill damage, in addition to activating the talent that reduces target's attack (disarm), and it activates all speed talents, and also activates the talent (Rallying Cry) that increases all damage for 10 seconds.
ar: هذه الشجرة فيها تفعيل لجميع المواهب التي ترفع أضرار المهارة ، بالاضافة الى تفعيل موهبة تقليل هجوم الهدف (نزع السلاح) من مسار الفرسان ، وفيها تفعيل لجميع مواهب السرعة ، وأيضا تفعيل موهبة نداء الحشد التي ترفع الأضرار الكلية لمدة 10 ثوان من مسار الفرسان الأخيرة

# zizka_tree_garrison_1
source: This tree includes raising skill damage, and reducing all skill damage received. From the Garrison Path it raises all damage, and reduces all damage received.
ar: هذه الشجرة شاملة رفع أضرار المهارة ، وتقليل جميع أضرار المهارة المتلقاة على زيزكا . ومن مسار الحامية ترفع جميع الأضرار الكلية ، وتقلل جميع الأضرار الكلية المتلقاة على زيزكا .

# zizka_tree_garrison_2
source: This tree focuses on raising skill damage, with a focus on increasing troop stats such as defense, health and attack, it also has a all damage increase, and reduction in all damage received in the garrison path.
ar: هذه الشجرة تركز على رفع أضرار المهارة بشكل كامل ، مع التركيز على رفع احصائيات القوات كدفاع وصحة وهجوم ، أيضا فيها رفع للأضرار الكلية ، وتقليل الأضرار الكلية المتلقاة على زيزكا من مسار الحامية .

# joanarck_tree_field_1
source: This tree focuses on reducing all skill damage received, in addition to activating the talent to reduce target's attack (Disarm)
ar: هذه الشجرة تركز على تقليل جميع أضرار المهارة المتلقاة ، بالاضافة الى تفعيل دي بف تقليل هجوم الهدف من موهبة (نزع السلاح) ، علما انه يمكنك سحب النقطة من تقليل هجوم الهدف و وضعها على موهبة مسار الدعم الأخيرة (قفص من الشوك) التي تقلل سرعة مسيرة 5 مسيرات حولك ان أردت هذا الدي بف

# nevsky_tree_field_1
source: This tree focuses on increasing all skill damage, in addition to activating the (feral Nature) talent, which contributes to activating the active skill faster.It is specifically recommended for those who do not have the horn accessory, and you can use it if you have a horn as well. That is fine. In the end, it is chance of gaining rage points issue.
ar: هذه الشجرة تركز على رفع جميع أضرار المهارة ، بالاضافة لتفعيل موهبة (الطبيعة الوحشية) التي تساهم في تفعيل ضربة المهارة الأولى بشكل أسرع وينصح بها تحديدا من لا يملكون اكسسوار البوق، وتستطيع استعماله لو لديك بوق كذلك لا بأس بذلك ، في النهاية أنت تلعب على فرص اكتساب نقاط غضب

# nevsky_tree_field_2
source: This tree activates all talents that increase skill damage, in addition to activating the target's attack reduction (disarm) talent, and it activates all speed talents.
ar: هذه الشجرة فيها تفعيل لجميع المواهب التي ترفع أضرار المهارة ، بالاضافة الى تفعيل موهبة(نزع السلاح) التي تقلل هجوم الهدف من مسار الفرسان ، وفيها تفعيل لجميع مواهب السرعة

# nevsky_tree_rally_1
source: This tree focuses on increasing all skill damage, in addition to activating the (feral Nature) talent, which contributes to activating the active skill faster.It is specifically recommended for those who do not have the horn accessory, and you can use it if you have a horn as well. That is fine. In the end, it is chance of gaining rage points issue.
ar: هذه الشجرة تركز على رفع جميع أضرار المهارة ، بالاضافة لتفعيل موهبة (الطبيعة الوحشية) التي تساهم في تفعيل ضربة المهارة الأولى بشكل أسرع وينصح بها تحديدا من لا يملكون اكسسوار البوق، وتستطيع استعماله لو لديك بوق كذلك لا بأس بذلك ، في النهاية أنت تلعب على فرص اكتساب نقاط غضب

# nevsky_tree_rally_2
source: This tree activates all talents that increase skill damage, in addition to activating the target's attack reduction (disarm) talent, and it activates all speed talents.
ar: هذه الشجرة فيها تفعيل لجميع المواهب التي ترفع أضرار المهارة ، بالاضافة الى تفعيل موهبة (نزع السلاح) التي تقلل هجوم الهدف من مسار الفرسان ، وفيها تفعيل لجميع مواهب السرعة

# xy_tree_field_1
source: This tree focuses on increasing all skill damage, in addition to activating the (feral Nature) talent, which contributes to activating the active skill faster.It is specifically recommended for those who do not have the horn accessory, and you can use it if you have a horn as well. That is fine. In the end, it is chance of gaining rage points issue.
ar: هذه الشجرة تركز على تقوية أضرار المهارة ، مع تفعيل موهبة (الطبيعة الوحشية) من مسار المهارة التي تعزز من سرعة تفعيل المهارة الأولى للقائد . علما ان هذا التصميم ينصح به من لا يملك اكسسوار البوق خاصة ، ويناسب كذلك من يمتلكون بوق لو أرادوا تعزيز سرعة تفعيل المهارة الأولى

# xy_tree_field_2
source: This tree focuses on increasing skill damage, while activating the (Disarm) talent that reduces target's attack, plus increasing the cavalry speed.
ar: هذه الشجرة تركز على تقوية أضرار المهارة ، مع تفعيل موهبة (نزع السلاح) التي تقلل هجمات الهدف ، اضافة الى انك رفعت معدل سرعة الفرسان مع هذا التصميم

# xy_tree_field_3
source: This tree focuses on increasing skill damage, with the activation of the (Buckler Shield) talent that reduces counterattack damage received.
ar: هذه الشجرة تركز على تقوية أضرار المهارة ، مع تفعيل موهبة (ترس الدرع) التي تقلل الأضرار المضادة المتلقاة عليك ، ونادرا ما نستعمل هذا التصميم ، وهي مناسبة لكل الظروف ولكن على وجه التحديد لهدف السوارم على المباني أو الحشود

# wallace_tree_field_1
source: This design increases the speed of the infantry, while keeping the talents that increase the smite damage from the smite path.
ar: هذا التصميم فيه رفع لسرعة المشاة ، مع الحفاظ على تقوية أضرار الضربة القاضية من الموهبة الأخيرة من مسار الضربة القاضية
