Repository: mohammadzyoud1/ROK-app
Catalog: lib/l10n/app_*.arb
Languages: ar

# wallace_tree_field_2
source: This design uses and activates the talent (pack a punch) which increases the smite damage ,and receives more normal damage, but the greater focus with this design is on increasing the smite damage.
ar: هذا التصميم فيها استخدام وتفعيل لموهبة (التأثير القوي) التي ترفع اضرار الضربة القاضية ، و تتلقى أضرار عادية أكبر ، ولكن التركيز الأكبر مع هذا التصميم على زيادة قوة أضرار الضربة القاضية

# wallace_tree_field_3
source: Hit and Run Tree, here you rely on raising all the damage of the smite damage while benefiting with all the speed points, we abandoned the talent (Hold the line) that reduces all the damage received because it only activates if the leader is by basic attack, in other words when the opponent attacks you. As long as you are hitting targets and running, this talent will not activate and that is why we abandoned it
ar: شجرة اضرب و اهرب, هنا انت تعتمد على رفع جميع أضرار الضربة القاضية مع الاستفادة مع جميع نقاط السرعة ، تخليت عن موهبة (احفظ مكانك) التي تقلل جميع الأضرار المتلقاة بسبب انها لا تتفعل الا اذا تعرض القائد الى هجوم أساسي ، بمعنى آخر عندما يهاجمني الخصم . فطالما أنك تضرب أهداف وتهرب ، هذه الموهبة لن تتفعل ولذلك تخلينا عنها

# wallace_tree_rally_1
source: Here you will use the talent (To the Bitter End) which will serve you in rally and it is this which is preferred only for rally and not for the field.
ar: هنا سوف تستخدم موهبة (الى النهاية المريرة) التي ستخدمك في الحشود ألا وهي هذه وهي المفضلة فقط للحشود وليس للميدان

# ameilianus_tree_field_1
source: This design increases the speed of the infantry, while keeping the talents that increase the smite damage from the smite path.
ar: هذا التصميم فيه رفع لسرعة المشاة ، مع الحفاظ على تقوية أضرار الضربة القاضية من الموهبة الأخيرة من مسار الضربة القاضية

# ameilianus_tree_field_2
source: This design uses and activates the talent (pack a punch) which increases the smite damage ,and receives more normal damage, but the greater focus with this design is on increasing the smite damage.
ar: هذا التصميم فيها استخدام وتفعيل لموهبة (التأثير الثوي) التي ترفع اضرار الضربة القاضية ، ولكن تتلقى أضرار عادية أكبر ، ولكن التركيز الأكبر مع هذا التصميم على زيادة قوة أضرار الضربة القاضية

# ameilianus_tree_field_3
source: Hit and Run Tree, here you rely on raising all the damage of the smite damage while benefiting with all the speed points, we abandoned the talent (Hold the line) that reduces all the damage received because it only activates if the leader is by basic attack, in other words when the opponent attacks you. As long as you are hitting targets and running, this talent will not activate and that is why we abandoned it
ar: هنا انت تعتمد على رفع جميع أضرار الضربة القاضية مع الاستفادة مع جميع نقاط السرعة ، تخليت عن موهبة (احفظ مكانك) التي تقلل جميع الأضرار المتلقاة بسبب انها لا تتفعل الا اذا تعرض القائد الى هجوم أساسي ، بمعنى آخر عندما يهاجمني الخصم . فطالما أنك تضرب أهداف وتهرب ، هذه الموهبة لن تتفعل ولذلك تخلينا عنها

# ameilianus_tree_rally_1
source: Here you will use the talent (To the Bitter End) which will serve you in rally and it is this which is preferred only for rally and not for the field.
ar: هنا سوف تستخدم الموهبة التي ستخدمك في الحشود ألا وهي (الى النهاية المريرة) المفضلة فقط للحشود وليس للميدان

# scipio_tree_field_1
source: Thsi design covers all Scipio's needs
ar: هذا التصميم شامل كل ما يحتاجه سكيبيو

# liuche_tree_field_1
source: this design covers all talents needed to increase the commander's damage in attack path
ar: هذا التصميم شامل جميع مواهب الأضرار الذي يحتاجها القائد بمسار الهجوم

# liuche_tree_field_2
source: This design focuses on infantry stats, as well as the most important talents of the attack path
ar: هذا التصميم يركز على جانب احصائيات قوات المشاة ، بالاضافة الى أهم مواهب مسار الهجوم اذا كنت لا تريد التركيز على مواهب الأضرار الأخرى

# gorgo_tree_field_1
source: gotgo's march is slow so we benefit from speed points from infantry path while foucsing on infantry stats from infantry path
ar: مسيرة قورقو بطيئة ، فلا بد من استغلال نقاط السرعة في مسار المشاة مع التركيز على احصائيات المشاة

# gorgo_tree_garrison_1
source: This design is used if the garrison is fully reinforced with 100% infantry, It is the best design to against skill damage commanders and not smite damage commanders or commanders who do not have skill damage like Attila/Takeda.
ar: هذا التصميم اذا كانت الحامية تعزيزها بالكامل مشاة 100% ، وهو أفضل تصميم لمواجهة قادة أضرار المهارة وليس قادة أضرار الضربة القاضية أو قادة لا يمتلكون أضرار مهارة مثل أتيلا / تاكيدا ، ففي هذه الحالة هناك تصميم آخر خاص للقادة الذين لا يسببون أضرار مهارة اطلاقا

# gorgo_tree_garrison_2
source: This design is used if the garrison is fully reinforced with 100% infantry, It is the best design to against smite damage commanders or commanders who do not have skill damage like Attila/Takeda
ar: هذا التصميم اذا كانت الحامية تعزيزها بالكامل مشاة 100% ، وهو أفضل تصميم لمواجهة قادة أضرار الضربة القاضية أو قادة لا يسببون أضرار مهارة كـ أتيلا / تاكيدا . فهذا التصميم مخصص لهم لأن المواهب في التصميم السابق كانت ترتكز بعضها على تقليل أضرار المهارة من مسار الحامية ومسار الدفاع ، ولكن هنا نزعنا النقاط من هذه المواهب التي لن تخدمك أمام قادة أضرار الضربة القاضية أو أتيلا / تاكيدا

# gorgo_tree_garrison_3
source: This design for mixed garrison, and it is strong against all commanders
ar: هذا التصميم اذا كانت الحامية تعزيزها عبارة عن قوات خليطة ، وهو أفضل تصميم لمواجهة جميع القادة

# tariq_tree_field_1
source: Tariq's march speed is slow, so you should take advantage of the speed points in the infantry path while focusing on the infantry stats. In addition, you will benefit from reducing the counterattack damage received from the talent in the conquering path.
ar: مسيرة طارق بطيئة ، فلا بد من استغلال نقاط السرعة في مسار المشاة مع التركيز على احصائيات المشاة . نعلم أن هناك من يفضل الذهاب لآخر موهبة من مسار الدفاع ولكن هي لا تتفعل الا عندما يتبقى 30% من قواتك وهذه في الميدان غير مستحبة إنما كحشود مطوّلة فلا بأس ، بالاضافة الى أنك ستستفيد من تقليل الأضرار المضادة المتلقاة عليك من الموهبة التي في مسار الاحتلال

# tariq_tree_rally_1
source: This design to reduce the counterattack damage taken from the garrison
ar: هذا التصميم غرضه تقليل الأضرار المضادة المتلقاة من الحامية

# tariq_tree_rally_2
source: This design to benefit from the last talent in defense path wich grants 25 rage points after each basic attack when the toops rate is under 30%
ar: هذا التصميم غرضه عندما تصل قوات القائد تحت 30% سوف يكتسب القائد 25 عاصفة غضب كلما شنّ القائد هجمة أساسية من موهبة الدفاع الأخيرة مما تسرع من عملية اطلاق المهارة الأولى

# tariq_tree_rally_3
source: This design to increase the damage by 3% from conquering path
ar: هذا التصميم يركز على زيادة الأضرار الكلية بنسبة 3% من مسار الاحتلال

# sargon_tree_field_1
source: This tree focuses on increasing all skill damage, in addition to activating the (feral Nature) talent, which contributes to activating the active skill faster.It is specifically recommended for those who do not have the horn accessory, and you can use it if you have a horn as well. That is fine. In the end, it is chance of gaining rage points issue.
ar: هذا التصميم يركز على موهبة (الطبيعة الوحشية) التي تسرع من عملية ضربة المهارة الأولى للقائد بشكل أسرع ، فهي مفضلة لمن لا يمتلك البوق ولكن اذا كنت تمتلكه فلا بأس باستعمال هذا التصميم فهذه الموهبة في النهاية تعمل تحت فرصة معينة

# sargon_tree_field_2
source: This design focuses on increasing the speed of infantry in the field, and also having a debuff that reduces the target's speed for 2 seconds. In addition, you will benefit from the most important talents of the skill path that focus on increasing skill damage specifically.
ar: هذا التصميم يركز على رفع سرعة المشاة في الميدان ، وأيضا امتلاك دي بف تقليل سرعة الهدف لثانيتين . بالاضافة الى أنك سوف تنتفع من أهم مواهب مسار المهارة التي تركز على رفع أضرار المهارة تحديدا

# sargon_tree_field_3
source: This design focuses on the (Latent Power) talent which is only for any commander who has additional skill damage for more than a second, it is also preferred for those who do not have the horn but if you have it then it is okay to use this design. In the end, it is chance of gaining rage points issue.
ar: هذا التصميم يركز على موهبة (الطاقة الكامنة) التي هي تخص فقط أي قائد يمتلك ضرر مهارة اضافي لأكثر من ثانية ، أيضا هي مفضلة لمن لا يمتلك البوق ولكن اذا كنت تمتلكه فلا بأس باستعمال هذا التصميم فهذه الموهبة في النهاية تعمل تحت فرصة معينة

# sargon_tree_field_4
source: This design focuses on increasing the speed of infantry in the field, while also maintaining the (Latent Power) talent that works with any leader who has additional skill damage for more than a second, in addition to that you will benefit from the most important talents of the skill path that focus on increasing skill damage specifically.
ar: هذا التصميم يركز على رفع سرعة المشاة في الميدان ، وأيضا مع الحفاظ على موهبة (الطاقة الكامنة) التي هي تعمل مع أي قائد يمتلك ضرر مهارة اضافي لأكثر من ثانية ، بالاضافة الى أنك سوف تنتفع من أهم مواهب مسار المهارة التي تركز على رفع أضرار المهارة تحديدا

# guan_tree_field_1
source: This tree focuses on increasing all skill damage, in addition to activating the (feral Nature) talent, which contributes to activating the active skill faster.It is specifically recommended for those who do not have the horn accessory, and you can use it if you have a horn as well. That is fine. In the end, it is chance of gaining rage points issue.
ar: هذا التصميم يركز على موهبة (الطبيعة الوشحية) التي تسرع من عملية ضربة المهارة الأولى للقائد بشكل أسرع ، فهي مفضلة لمن لا يمتلك بوق ولكن اذا كنت تمتلكه فلا بأس باستعمال هذا التصميم فهذه الموهبة في النهاية تعمل تحت فرصة معينة

# guan_tree_field_2
source: This design focuses on increasing the speed of infantry in the field, and also having a debuff that reduces the target's speed for 2 seconds. In addition, you will benefit from the most important talents of the skill path that focus on increasing skill damage specifically.
ar: هذا التصميم يركز على رفع سرعة المشاة في الميدان ، وأيضا امتلاك دي بف تقليل سرعة الهدف لثانيتين . بالاضافة الى أنك سوف تنتفع من أهم مواهب مسار المهارة التي تركز على رفع أضرار المهارة تحديدا

# guan_tree_field_3
source: This design focuses on increasing the speed of infantry in the field, and also having a debuff that reduces the target's speed for 2 seconds. In addition, you will benefit from the most important talents of the skill path that focus on increasing skill damage specifically. Moreover, the design have the talent talent (Buckler shield) from the conquering path which reduces the counterattack damage taken.
ar: هذا التصميم يركز على رفع سرعة المشاة في الميدان ، وأيضا امتلاك دي بف تقليل سرعة الهدف لثانيتين . بالاضافة الى أنك سوف تنتفع من أهم مواهب مسار المهارة التي تركز على رفع أضرار المهارة تحديدا . لاحظ أن التصميم كذلك يركز على تقليل الأضرار المضادة المتلقاة عليك عند ضرب أي هدف من خلال الموهبة التي في مسار الاحتلال

# guan_tree_field_4
source: This design focuses on the (Latent Power) talent which is only for any commander who has additional skill damage for more than a second, it is also preferred for those who do not have the horn but if you have it then it is okay to use this design. In the end, it is chance of gaining rage points issue.
ar: هذا التصميم يركز على موهبة (الطاقة الكامنة) التي هي تخص فقط أي قائد يمتلك ضرر مهارة اضافي لأكثر من ثانية ، أيضا هي مفضلة لمن لا يمتلك الوبق ولكن اذا كنت تمتلكه فلا بأس باستعمال هذا التصميم فهذه الموهبة في النهاية تعمل تحت فرصة معينة

# guan_tree_field_5
source: This design focuses on increasing the speed of infantry in the field, while also maintaining the (Latent Power) talent that works with any leader who has additional skill damage for more than a second, in addition to that you will benefit from the most important talents of the skill path that focus on increasing skill damage specifically.
ar: هذا التصميم يركز على رفع سرعة المشاة في الميدان ، وأيضا مع الحفاظ على موهبة (الطاقة الكامنة) التي هي تعمل مع أي قائد يمتلك ضرر مهارة اضافي لأكثر من ثانية ، بالاضافة الى أنك سوف تنتفع من أهم مواهب مسار المهارة التي تركز على رفع أضرار المهارة تحديدا

# guan_tree_field_6
source: This design focuses on increasing the speed of infantry in the field, while also maintaining the (Latent Power) talent that works with any leader who has additional skill damage for more than a second, in addition to that you will benefit from the most important talents of the skill path that focus on increasing skill damage specifically. Moreover, the design have the talent (Buckler shield) from the conquering path which reduces the counterattack damage taken.
ar: هذا التصميم يركز على رفع سرعة المشاة في الميدان ، وأيضا مع الحفاظ على موهبة (الطاقة الكامنة) التي هي تعمل مع أي قائد يمتلك ضرر مهارة اضافي لأكثر من ثانية ، بالاضافة الى أنك سوف تنتفع من أهم مواهب مسار المهارة التي تركز على رفع أضرار المهارة تحديدا . لاحظ أن التصميم كذلك يركز على تقليل الأضرار المضادة المتلقاة عليك عند ضرب أي هدف من خلال الموهبة التي في مسار الاحتلال

# yeong_tree_garrison_1
source: This tree focuses on increasing all damage in the Garrison and Archers path, as well as reducing all damage and skill damage taken in the Garrison and Defense path. This build is used when the troops are full Archers against skill damage commanders.
ar: هذه الشجرة تركز على تقوية الأضرار الكلية من مسار الحامية والرماة اذا كانت القوات رماة فقط ، بالاضافة لتقليل الأضرار الكلية المتلقاة وأيضا أضرار المهارة على وجه التحديد من مسار الحامية والدفاع

# yeong_tree_garrison_2
source: This tree focuses on the most important talents of the garrison to increase the all damage and reduce the all damage received ,also from the support path towards activating a talent that gives rage points if Yeong's forces reach below 30% he gains 20 rage points with every basic attack he launches. This build is used against skill damage commanders.
ar: هذه الشجرة تركز على أهم مواهب مسار الحامية من رفع الأضرار الكلية وتقليل الأضرار الكلية المتلقاة عليه ، أيضا من مسار الدعم اتجاها الى تفعيل موهبة تعطي نقاط غضب اذا وصلت قوات يونغ تحت 30% فإنه يكتسب 20 نقطة غضب مع كل هجمة أساسية يطلقها

# yeong_tree_garrison_3
source: This tree focuses on activating the most important talents of the garrison path, like increasing all damage and reducing all damage received, in addition to reducing skill damage specifically. It also activates the talent of increasing all stats of all troops attack, defense and health. This build is used against skill damage commanders.
ar: هذه الشجرة تركز على تفعيل أهم مواهب مسار الحامية من رفع الأضرار الكلية وتقليل الأضرار الكلية المتلقاة اضافة الى تقليل اضرار المهارة على وجه التحديد . اتجاها بتفعيل موهبة رفع جميع احصائيات كل القوات من هجوم ودفاع وصحة

# yeong_tree_garrison_4
source: Any talent that reduces the skill damage taken is not needed if the target is skill damage or true damage commander, so stick with this design to reduce all damage received and strengthens the total damage of the leader through the archers path with (whistling Arrows) if the troops are archers only, and activate the most important talents of the garrison path that reduce the all damage received, in addition to raising the all damage , reaching to raising the stats of all troops from attack, defense and health.
ar: أي موهبة تقلل ضرر مهارة أنت لست بحاجتها اذا كان الهدف أمامك يسبب ضرر ضربة قاضية أو ضرر حقيقي مستقبلا ، التزم مع هذا التصميم لتقليل جميع الأضرار المتلقاة عليك والتي فيها تقوية للأضرار الكلية للقائد من خلال مسار الرماة مع موهبة (اسهم الصافرة)ذا كانت القوات رماة فقط ، وتفعيل أهم مواهب مسار الحامية بتقليل الأضرار الكلية المتلقاة عليه ، بالاضافة لرفع الأضرار الكلية الخاصة بـ يونغ ، وصولا الى رفع احصائيات جميع القوات من هجوم ودفاع وصحة

# yeong_tree_garrison_5
source: Any talent that reduces the skill damage taken is not needed if the target is skill damage or true damage commander, so stick with this design to reduce all damage received, and activate the most important talents of the garrison path that reduce the all damage received, in addition to raising the all damage , reaching to raising the stats of all troops from attack, defense and health. This build focuses more on the indurance aspect than the damage due to the focus on indurance talents such as activating healing (Medicinal Supplies ), reducing damage received (Testudo Formation) in the defense path as well.
ar: أي موهبة تقلل ضرر مهارة أنت لست بحاجتها اذا كان الهدف أمامك يسبب ضرر ضربة قاضية أو ضرر حقيقي مستقبلا ، التزم مع هذا التصميم لتقليل جميع الأضرار المتلقاة عليك ، وتفعيل أهم مواهب مسار الحامية بتقليل الأضرار الكلية المتلقاة عليه ، بالاضافة لرفع الأضرار الكلية الخاصة بـ يونغ ، وصولا الى رفع احصائيات جميع القوات من هجوم ودفاع وصحة هذا التصميم يركز على جانب رفع الصمود أكثر من الأضرار نظرا بالتركيز الكبير على مواهب الصمود مثل تفعيل العلاج (لوازم طبية) ، تقليل الأضرار المتلقاة (تشكيلة تيستيدو) من مسار الدفاع أيضا

# shajar_tree_field_1
source: This is a tree that aims to activate active skill faster, especially if you do not have a horn of fury, this is the one for you, and if you have a horn of fury , it is also suitable for you. It focuses on raising all skill damage in general.
ar: هذه شجرة هدفها تفعيل المهارة الأولى بشكل أسرع بالأخص اذا كنت لا تمتلك بوق ، فهذه هي المناسبة لك ، ولو كنت تمتلك بوق أيضا هي مناسبة لك ان أحببت اللعب بهذا التصميم . وتركز على رفع جميع أضرار المهارة عموما

# shajar_tree_field_2
source: This tree focuses on increasing skill damage, as well as all damage through the Archer Path talent (whistling Arrows). This is more specifically suited for those with horn of fury or drum.
ar: هذه الشجرة تركز على تقوية أضرار المهارة ، وأيضا تقوية الأضرار الكلية من خلال موهبة (اسهم الصافرة) الخاصة بمسار الرماة . وهذه مناسبة تحديدا أكثر لمن لديهم بوق أو طبلة عموما

# ashur_tree_field_1
source: This is a tree that aims to activate active skill faster, especially if you do not have a horn of fury, this is the one for you, and if you have a horn of fury , it is also suitable for you. It focuses on raising all skill damage in general.
ar: هذه شجرة هدفها تفعيل المهارة الأولى بشكل أسرع بالأخص اذا كنت لا تمتلك بوق ، فهذه هي المناسبة لك ، ولو كنت تمتلك بوق أيضا هي مناسبة لك ان أحببت اللعب بهذا التصميم . وتركز على رفع جميع أضرار المهارة عموما

# ashur_tree_field_2
source: This tree focuses on increasing skill damage, as well as all damage through the Archer Path talent (whistling Arrows). This is more specifically suited for those with horn of fury or drum.
ar: هذه الشجرة تركز على تقوية أضرار المهارة ، وأيضا تقوية الأضرار الكلية من خلال موهبة (اسهم الصافرة)الخاصة بمسار الرماة . وهذه مناسبة تحديدا أكثر لمن لديهم بوق أو طبلة عموما

# ashur_tree_field_3
source: This is a tree that aims to activate active skill faster, especially if you do not have a horn of fury, this is the one for you, and if you have a horn of fury , it is also suitable for you. It focuses on raising all skill damage in general.Moreover, the design have the talent talent (Buckler shield) from the conquering path which reduces the counterattack damage taken.
ar: هذه شجرة هدفها تفعيل المهارة الأولى بشكل أسرع بالأخص اذا كنت لا تمتلك بوق ، فهذه هي المناسبة لك ، ولو كنت تمتلك بوق أيضا هي مناسبة لك ان أحببت اللعب بهذا التصميم . وتركز على رفع جميع أضرار المهارة عموما ، كذلك تقلل الأضرار المضادة المتلقاة من خلال من خلال موهبة (ترس الدرع)

# ashur_tree_rally_1
source: This is a tree that aims to activate active skill faster, especially if you do not have a horn of fury, this is the one for you, and if you have a horn of fury , it is also suitable for you. It focuses on raising all skill damage in general.Moreover, the design have the talent talent (Buckler shield) from the conquering path which reduces the counterattack damage taken.
ar: هذه شجرة هدفها تفعيل المهارة الأولى بشكل أسرع بالأخص اذا كنت لا تمتلك بوق ، فهذه هي المناسبة لك ، ولو كنت تمتلك بوق أيضا هي مناسبة لك ان أحببت اللعب بهذا التصميم . وتركز على رفع جميع أضرار المهارة عموما ، كذلك تقلل الأضرار المضادة المتلقاة من خلال موهبة (ترس الدرع)

# ashur_tree_rally_2
source: This tree focuses on increasing skill damage and activate (Entrenched) talent which increase the damage when attacking strongholds or cities.
ar: هذه الشجرة تركز على تقوية أضرار المهارة ، وأيضا تقوية الأضرار الكلية من خلال موهبة (محصن) الخاص بمسار الاحتلال

# herman_tree_field_1
source: This tree increases skill damage from the archer path, and focuses on increasing attack stats more. From the support path you will gain reduced skill damage received and also do debuff that reduces the march speed of 5 targets around you for 3 seconds.
ar: هذه شجرة ترفع أضرار المهارة من مسار الرماة ، وتركز على رفع معدل الهجوم بشكل أكبر . من مسار الدعم سوف تكتسب تقليل أضرار مهارة متلقاة عليك ، وأيضا تفعل دي بف تقليل سرعة مسيرة 5 اهداف حولك لمدة 3 ثوان

# herman_tree_field_2
source: This tree increases skill damage from the archer path and also all damage through (whistling arrows), and from the support path it reduces skill damage received through (loose formation) and (emergency protection).
ar: هذه شجرة ترفع أضرار المهارة من مسار الرماة وأيضا الأضرار الكلية من خلال(اسهم الصافرة) ، ومن مسار الدعم تقلل أضرار المهارة المتلقاة عليك عبر (تشكيلة حرة) و (حماية الطوارئ)

# liang_tree_field_1
source: This is a tree that aims to activate active skill faster, especially if you do not have a horn of fury, this is the one for you, and if you have a horn of fury , it is also suitable for you. It focuses on raising all skill damage in general.
ar: هذه شجرة هدفها تفعيل المهارة الأولى بشكل أسرع بالأخص اذا كنت لا تمتلك بوق ، فهذه هي المناسبة لك ، ولو كنت تمتلك بوق أيضا هي مناسبة لك ان أحببت اللعب بهذا التصميم . وتركز على رفع جميع أضرار المهارة عموما

# liang_tree_field_2
source: This tree focuses on increasing skill damage, as well as all damage through the Archer Path talent (whistling Arrows). This is more specifically suited for those with horn of fury or drum.
ar: هذه الشجرة تركز على تقوية أضرار المهارة ، وأيضا تقوية الأضرار الكلية من خلال موهبة (اسهم الصافرة) الخاصة بمسار الرماة . وهذه مناسبة تحديدا أكثر لمن لديهم بوق أو طبلة عموما

# henry_tree_field_1
source: This tree increases skill damage from the archer path and also all damage through (whistling arrows), and from the support path it reduces skill damage received through (loose formation) and (emergency protection).
ar: هذه الشجرة ترفع أضرار المهارة والأضرار الكلية من خلال موهبة(اسهم الصافرة) من مسار المهارة ، ويقلل اضرار المهارة المتلقاة عليه من خلال مسار الدعم (تشكيلة حرة) و (حماية الطوارئ)

# henry_tree_field_2
source: This tree increases skill damage from the archer path and also all damage through (whistling arrows), and from the support path it reduces skill damage received through (loose formation).Moreover, the design have the talent talent (Buckler shield) from the conquering path which reduces the counterattack damage taken.
ar: هذه الشجرة ترفع أضرار المهارة والأضرار الكلية من خلال (اسهم الصافرة) من مسار المهارة ، ويقلل اضرار المهارة المتلقاة عليه من خلال مسار الدعم (تشكيلة حرة)، وأيضا يقلل الأضرار المضادة المتلقاة من خلال (ترس الدرع)

# henry_tree_rally_1
source: This tree increases skill damage from the archer path and also all damage through (whistling arrows), and from the support path it reduces skill damage received through (loose formation).Moreover, the design have the talent talent (Buckler shield) from the conquering path which reduces the counterattack damage taken.
ar: هذه الشجرة ترفع أضرار المهارة والأضرار الكلية من خلال (اسهم الصافرة) من مسار المهارة ، ويقلل اضرار المهارة المتلقاة عليه من خلال مسار الدعم (تشكيلة حرة)، وأيضا يقلل الأضرار المضادة المتلقاة من خلال (ترس الدرع)
